{
    "_class_name": "UNet2DConditionModel",
    "_diffusers_version": "0.16.0.dev0",
    "act_fn": "silu",
    "addition_embed_type": "text",
    "addition_embed_type_num_heads": 64,
    "attention_head_dim": 64,
    "block_out_channels": [
      192,
      384,
      576,
      768
    ],
    "center_input_sample": false,
    "class_embed_type": null,
    "class_embeddings_concat": false,
    "conv_in_kernel": 3,
    "conv_out_kernel": 3,
    "cross_attention_dim": 768,
    "cross_attention_norm": "group_norm",
    "down_block_types": [
      "ResnetDownsampleBlock2D",
      "SimpleCrossAttnDownBlock2D",
      "SimpleCrossAttnDownBlock2D",
      "SimpleCrossAttnDownBlock2D"
    ],
    "downsample_padding": 1,
    "dual_cross_attention": false,
    "encoder_hid_dim": 768,
    "flip_sin_to_cos": true,
    "freq_shift": 0,
    "in_channels": 2,
    "layers_per_block": 3,
    "mid_block_only_cross_attention": null,
    "mid_block_scale_factor": 1,
    "mid_block_type": "UNetMidBlock2DSimpleCrossAttn",
    "norm_eps": 1e-05,
    "norm_num_groups": 32,
    "num_class_embeds": null,
    "only_cross_attention": false,
    "out_channels": 2,
    "projection_class_embeddings_input_dim": null,
    "resnet_out_scale_factor": 1.0,
    "resnet_skip_time_act": false,
    "resnet_time_scale_shift": "scale_shift",
    "sample_size": 320,
    "time_cond_proj_dim": null,
    "time_embedding_act_fn": null,
    "time_embedding_dim": null,
    "time_embedding_type": "positional",
    "timestep_post_act": null,
    "up_block_types": [
      "SimpleCrossAttnUpBlock2D",
      "SimpleCrossAttnUpBlock2D",
      "SimpleCrossAttnUpBlock2D",
      "ResnetUpsampleBlock2D"
    ],
    "upcast_attention": false,
    "use_linear_projection": false
  }
  